# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no
ticket = int(input("Введите номер билета: "))

digits = [int(d) for d in str(ticket)]


if len(digits) != 6:
    print("Номер билета должен состоять из 6 цифр.")
else:

    first_sum = sum(digits[:3])
    last_sum = sum(digits[3:])

    if first_sum == last_sum:
        print("Счастливый билет!")
    else:
        print("Обычный билет")
